--[[
    len(
    无索引 >> 数字索引 >> 字符索引(需要夹在连续的索引之间才有效))
    纯-无索引:默认自动从1开始
    无索引+数字索引:优先计数无索引个数，
    数字索引+字符索引:优先遍历数字索引，从1开始，断开的部分可由字符索引填补，输出时为nil，若无填补，则计数停止在断开前一个数字索引的位置
    注意:当某个元素被设为 nil 时，通过 pairs()) 打印只会将非 nil 打印出来，通过 len( 则会包括 nil 的数量,连续索引的最后一个必须有值，否则不计入其中
    ]]--
t1={}  --0
t2={"aaa","bbb","ccc","ddd","eee"}  --无索引时默认从1开始计数且连续
t3={"aaa","bbb",nil,"ddd","eee"}
t4={"aaa","bbb","ddd",0,"eee"}
t5={[1]="aaa",[2]="bbb",[3]="ccc",[4]="ddd",[5]="eee"}
t6={[1]="aaa",[2]="bbb",[3]="ddd",[5]="eee"}  --索引值断开时返回计数值
t7={[1]="aaa",[2]="bbb",[3]=nil,[4]="ddd",[5]="eee"}
t8={[1]="aaa",[2]="bbb",key1="ccc",[4]="ddd",[5]="eee",key2="fff",key3="ggg"}  --[4]是存在的,第三个位置也是有键值对存在的，只是键值不是数字
t9={[1]="aaa",[2]="bbb",key1="ccc",[5]="ddd",[6]="eee",key2="fff",key3="ggg",key4="hhh"}  --[5]在第4个的位置但已经标明了他是下标为 5 的键值对。下标为 3 的键值不是数字，第四个位置又无键值对，没有 [4] 的存在，故计数值停留在2

t10={[1]="aaa",[3]="bbb",[5]="ccc",[7]="ddd",[9]="eee"}
t11={[-1]="aaa",[-2]="bbb",[-3]="ccc",[-4]="ddd",[-5]="eee"}  --索引不可为负数
t12={q="aaa",w="bbb",e="ccc",a="ddd",s="eee"}  --索引不可为非数字
t13={[5]="aaa",[4]="bbb",[3]=nil,[2]="ddd",[1]="eee"}  --[1..n] 顺序打乱也是可以的
t14={[1]="aaa","bbb","ccc","ddd","eee"}  --索引不可为非数字
t15={key1="ccc",key2="fff",key3="ggg",key4="hhh",[1]="aaa",[2]="bbb",[5]="ddd",[6]="eee"}  --[5]在第4个的位置但已经标明了他是下标为 5 的键值对。下标为 3 的键值不是数字，第四个位置又无键值对，没有 [4] 的存在，故计数值停留在2
t16={[1]="aaa",[2]="bbb",[3]="eee",[4]="ddd",[5]=nil}
t17={[1]="aaa",[2]="bbb",key1=nil,[4]="ddd",[5]="eee",key2="fff",key3="ggg"}
t18={[1]=1,[2]=2,[3]=nil,[4]=nil,[5]=5,[6]=nil}
t19={1,2,nil,nil,5,nil}
t20={[1]=1,[2]=2,[3]=3,[4]=nil,[5]=5,[6]=nil}

t21={"aaa","bbb",[0]="ccc","ddd","eee"}
t22={"aaa","bbb",[1]="ccc","ddd","eee"}
t23={"aaa","bbb",[4]="ccc","ddd","eee"}
t24={"aaa","bbb",[5]="ccc","ddd","eee"}  --先累计无索引（假设值为n），再查找是否有以（n+1）作为索引的键值对
t25={"aaa","bbb",[5]="ccc","ddd","eee",[6]="fff"}
t26={"aaa","bbb",[5]="ccc","ddd","eee",[7]="fff"}

t41={[0]="aaa",[1]="bbb",[2]="ccc",[3]="ddd",[4]="eee"}  --索引从1开始
t42={[100]="aaa",[1]="bbb",[2]="ccc",[3]="ddd",[4]="eee"}  --索引从1开始
t43={[100]="aaa",[180]="xxx",[-60]="yyy",[60]="zzz",[1]="bbb",[2]="ccc",[3]="ddd",[4]="eee"}  --索引从1开始

t51={1,2,3,4}
t51[2]=nil
for k=1,#t51 do
    print(t51[k])
end

print("#t1=",#t1)
print("#t2=",#t2)
print("#t3=",#t3)
print("#t4=",#t4)
print("#t5=",#t5)
print("#t6=",#t6)
print("#t7=",#t7)
print("#t8=",#t8)
print("#t9=",#t9)
print("#t10=",#t10)
print("#t11=",#t11)
print("#t12=",#t12)
print("#t13=",#t13)
print("#t14=",#t14)
print("#t15=",#t15)
print("#t16=",#t16)
print("#t17=",#t17)
print("#t18=",#t18)
print("#t19=",#t19)
print("#t20=",#t20)
print("#t21=",#t21)
print("#t22=",#t22)
print("#t23=",#t23)
print("#t24=",#t24)
print("#t25=",#t25)
print("#t26=",#t26)

print("#t41=",#t41)
print("#t42=",#t42)
print("#t43=",#t43)

print("#t51=",#t51)